app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users" LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-06-29 20:42:08', '56fd40f6b8f8adb7b9fe2f9b2fb628633d08b21293fafb0c62d212230d1bf1a29c77ab95f4bf4205eb93b634a4f65212f9c17cb2e8b1fd1bb93f0f69be211464', '2009-06-29 20:42:08', 'pisti', 'R5uR-basBq3uhr_8FAg_', 'adae44b3a773179404c01697012d76571cc909d3cd40bd67a6d6f13f87cac0e66cfbf9f78051e7cf1f98629c5b23f3518a76de50c9b4f32824353d201133256b', 'istvan.kapcsandi@gmail.com')

  def edit
    @user = User.find(params[:id]) if root_admin? and params[:id] != 'current'
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1